
export const azkarSections = [
    { id: 'morning', name: 'أذكار الصباح', icon: '🌞' },
    { id: 'evening', name: 'أذكار المساء', icon: '🌜' },
    { id: 'prayer', name: 'أذكار بعد الصلاة', icon: '🕌' },
    { id: 'sleep', name: 'أذكار النوم', icon: '😴' },
    { id: 'wake', name: 'أذكار الاستيقاظ', icon: '🌅' },
    { id: 'doa', name: 'الْأدْعِيَةُ القرآنية  ', icon: '🤲' }
];


export const azkarData = {
  morning: [
    {
      id: 1,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nالله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.',
      description: 'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح'
    },
    {
      id: 2,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ',
      description: 'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)'
    },
    {
      id: 3,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.',
      description: ''
    },
    {
      id: 4,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.',
      description: ''
    },
    {
      id: 5,
      text: 'أصـبحنا وأصـبح المـلك لله والحمد لله ، لا إله إلا الله وحده لا شريك له، له المـلك وله الحمـد، وهو على كل شيء قدير ، رب أسـألـك خـير ما في هـذا اليوم وخـير ما بعـده ، وأعـوذ بك من شـر ما في هـذا اليوم وشر ما بعـده، رب أعـوذبك من الكسـل وسـوء الكـبر ، رب أعـوذ بك من عـذاب في النـار وعـذاب في القـبر.',
      description: ''
    },
    {
      id: 6,
      text: 'اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذبك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت .',
      description: 'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح'
    },
    {
      id: 7,
      text: 'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا',
      description: 'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة'
    },
    {
      id: 8,
      text: 'اللهـم إنـي أصبـحت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك.',
      description: 'من قالها أعتقه الله من النار'
    },
    {
      id: 9,
      text: 'اللهـم ما أصبـح بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر.',
      description: 'من قالها حين يصبح أدى شكر يومه'
    },
    {
      id: 10,
      text: 'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم',
      description: 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة'
    },
    {
      id: 11,
      text: 'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم',
      description: 'من قالها لم يضره من الله شيء'
    },
    {
      id: 12,
      text: 'اللهـم بك أصـبحنا وبك أمسـينا ، وبك نحـيا وبك نمـوت وإلـيك النـشور',
      description: ''
    },
    {
      id: 13,
      text: 'أصبـحـنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين.',
      description: ''
    },
    {
      id: 14,
      text: 'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه',
      description: ''
    },
    {
      id: 15,
      text: 'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت.',
      description: ''
    },
    {
      id: 16,
      text: 'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت',
      description: ''
    },
    {
      id: 17,
      text: 'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي.',
      description: ''
    },
    {
      id: 18,
      text: 'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين',
      description: ''
    },
    {
      id: 19,
      text: 'أصبـحـنا وأصبـح المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده.',
      description: ''
    },
    {
      id: 20,
      text: 'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم.',
      description: ''
    },
    {
      id: 21,
      text: 'أعـوذ بكلمـات الله التـامـات من شـر ما خلـق',
      description: ''
    },
    {
      id: 22,
      text: 'اللهم صل وسلم وبارك على نبينا محمد',
      description: ''
    },
    {
      id: 23,
      text: 'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه.',
      description: ''
    },
    {
      id: 24,
      text: 'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال.',
      description: ''
    },
    {
      id: 25,
      text: 'أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه.',
      description: ''
    },
    {
      id: 26,
      text: 'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك.',
      description: ''
    },
    {
      id: 27,
      text: 'اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا.',
      description: ''
    },
    {
      id: 28,
      text: 'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم.',
      description: ''
    },
    {
      id: 29,
      text: 'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير.',
      description: ''
    },
    {
      id: 30,
      text: 'سبحـان الله وبحمـده.',
      description: ''
    },
    {
      id: 31,
      text: 'أستغفر الله وأتوب إليه',
      description: ''
    },
  ],
  evening: [
    {
      id: 1,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nالله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.',
      description: 'من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح'
    },
    {
      id: 2,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nآمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ',
      description: 'من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.'
    },
    {
      id: 3,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقل هو ٱلله أحد، ٱلله ٱلصمد، لم يلد ولم يولد، ولم يكن لهۥ كفوا أحدۢ',
      description: 'من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)'
    },
    {
      id: 4,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.',
      description: ''
    },
    {
      id: 5,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.',
      description: ''
    },
    {
      id: 6,
      text: 'أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.',
      description: ''
    },
    {
      id: 7,
      text: 'اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .',
      description: 'من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.'
    },
    {
      id: 8,
      text: 'رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.',
      description: 'من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.'
    },
    {
      id: 9,
      text: 'اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.',
      description: 'من قالها أعتقه الله من النار.'
    },
    {
      id: 10,
      text: 'اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.',
      description: 'من قالها حين يمسى أدى شكر يومه.'
    },
    {
      id: 11,
      text: 'حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.',
      description: 'من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.'
    },
    {
      id: 12,
      text: 'بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.',
      description: 'لم يضره من الله شيء.'
    },
    {
      id: 13,
      text: 'اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.',
      description: ''
    },
    {
      id: 14,
      text: 'أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.',
      description: ''
    },
    {
      id: 15,
      text: 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.',
      description: ''
    },
    {
      id: 16,
      text: 'اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.',
      description: ''
    },
    {
      id: 17,
      text: 'اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.',
      description: ''
    },
    {
      id: 18,
      text: 'اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.',
      description: ''
    },
    {
      id: 19,
      text: 'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.',
      description: ''
    },
    {
      id: 20,
      text: 'أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.',
      description: ''
    },
    {
      id: 21,
      text: 'اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.',
      description: ''
    },
    {
      id: 22,
      text: 'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.',
      description: ''
    },
    {
      id: 23,
      text: 'اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.',
      description: 'من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.'
    },
    {
      id: 24,
      text: 'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.',
      description: ''
    },
    {
      id: 25,
      text: 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.',
      description: ''
    },
    {
      id: 26,
      text: 'أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.',
      description: ''
    },
    {
      id: 27,
      text: 'يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.',
      description: ''
    },
    {
      id: 28,
      text: 'لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.',
      description: 'كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.'
    },
    {
      id: 29,
      text: 'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.',
      description: ''
    },
    {
      id: 30,
      text: 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ.',
      description: ''
    },
  ],
  prayer: [
    {
      id: 1,
      text: 'أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.',
      description: 'ثلاث مرات'
    },
    {
      id: 2,
      text: 'اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام',
      description: 'مره واحده فقط'
    },
    {
      id: 3,
      text: 'لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد.',
      description: 'مره واحده فقط'
    },
    {
      id: 4,
      text: 'لا إلهَ إلاّ اللّـه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.',
      description: 'مره واحده فقط'
    },
    {
      id: 5,
      text: 'سُـبْحانَ اللهِ، والحَمْـدُ لله ، واللهُ أكْـبَر.',
      description: 'ثلاثا وثلاثين مره'
    },
    {
      id: 6,
      text: 'لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.',
      description: 'مره واحده فقط'
    },
    {
      id: 7,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
      description: ''
    },
    {
      id: 8,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقل أعوذ برب ٱلفلق، من شر ما خلق، ومن شر غاسق إذا وقب، ومن شر ٱلنفٰثٰت فى ٱلعقد، ومن شر حاسد إذا حسد.',
      description: ''
    },
    {
      id: 9,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقل أعوذ برب ٱلناس، ملك ٱلناس، إلٰه ٱلناس، من شر ٱلوسواس ٱلخناس، ٱلذى يوسوس فى صدور ٱلناس، من ٱلجنة وٱلناس.',
      description: 'ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى.'
    },
    {
      id: 10,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nالله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.',
      description: 'مره واحده فقط'
    },
    {
      id: 11,
      text: 'لا إله إلا الله وحـده لا شريك له، له الملك وله الحمد، يحيـي ويمـيت وهو على كل شيء قدير',
      description: 'عشر مرات بعد المغرب والصـبح'
    },
    {
      id: 12,
      text: 'اللهـم إنـي أسألـك علمـا نافعـا ورزقـا طيـبا ، وعمـلا متقـبلا.',
      description: 'بعد السلام من صلاة الفجر'
    },
    {
      id: 13,
      text: 'اللهم أجرني من النار',
      description: 'بعد صلاة الصبح والمغرب'
    },
    {
      id: 14,
      text: 'اللهم أعني على ذكرك وشكرك وحسن عبادتك',
      description: 'مره واحده فقط'
    },
  ],
  sleep: [
    {
      id: 1,
      text: 'باسمك ربـي وضعـت جنـبي ، وبك أرفعـه، فإن أمسـكت نفسـي فارحـمها ، وإن أرسلتـها فاحفظـها بمـا تحفـظ به عبـادك الصـالحـين.',
      description: ''
    },
    {
      id: 2,
      text: 'اللهـم إنـك خلـقت نفسـي وأنـت توفـاهـا لك ممـاتـها ومحـياها ، إن أحييـتها فاحفظـها ، وإن أمتـها فاغفـر لـها . اللهـم إنـي أسـألـك العـافـية.',
      description: ''
    },
    {
      id: 3,
      text: 'اللهـم قنـي عذابـك يـوم تبـعث عبـادك.',
      description: ''
    },
    {
      id: 4,
      text: 'باسـمك اللهـم أمـوت وأحـيا.',
      description: ''
    },
    {
      id: 5,
      text: 'الـحمد لله الذي أطـعمنا وسقـانا، وكفـانا، وآوانا، فكـم ممـن لا كـافي لـه ولا مـؤوي',
      description: ''
    },
    {
      id: 6,
      text: 'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه، أشهـد أن لا إلـه إلا أنت، أعـوذ بك من شـر نفسـي، ومن شـر الشيـطان وشـركه، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم .',
      description: ''
    },
    {
      id: 7,
      text: 'اللهـم أسـلمت نفـسي إلـيك، وفوضـت أمـري إلـيك، ووجـهت وجـهي إلـيك، وألـجـات ظهـري إلـيك، رغبـة ورهـبة إلـيك، لا ملجـأ ولا منـجـا منـك إلا إلـيك، آمنـت بكتـابك الـذي أنزلـت وبنبـيـك الـذي أرسلـت',
      description: ''
    },
    {
      id: 8,
      text: 'سبحان الله.',
      description: '33 مرة'
    },
    {
      id: 9,
      text: 'الحمد لله.',
      description: '33 مرة'
    },
    {
      id: 10,
      text: 'الله أكبر.',
      description: '34 مرة'
    },
    {
      id: 11,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nآمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ',
      description: 'من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.'
    },
    {
      id: 12,
      text: 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nالله لا إلـه إلا هو الحي القيوم لا تأخذه سنة ولا نوم له ما في السماوات وما في الأرض من ذا الذي يشفع عنده إلا بإذنه يعلم ما بين أيديهم وما خلفهم ولا يحيطون بشيء من علمه إلا بما شاء وسع كرسيه السماوات والأرض ولا يؤوده حفظهما وهو العلي العظيم.',
      description: ''
    },
    {
      id: 13,
      text: 'عن بريدة رضي الله عنه، قال‏:‏ شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم فقال‏:‏ يا رسول الله‏!‏ ما أنام الليل من الأرق، فقال النبي صلى الله عليه وسلم‏:‏ ‏"‏إذا أويت إلى فراشك فقل‏:‏ اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا أنت‏" ',
      description: 'أذكار من قلق في فراشه ولم ينم'
    },
    {
      id: 14,
      text: 'عن عمرو بن شعيب، عن أبيه، عن جده: أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع كلمات‏:‏ ‏"‏أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون‏"',
      description: 'أذكار من قلق في فراشه ولم ينم'
    },
    {
      id: 15,
      text: 'عن أبي قتادة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏"‏الرؤيا الصالحة‏"‏ وفي رواية ‏"‏الرؤيا الحسنة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن شماله ثلاثا وليتعوذ من الشيطان، فإنها لا تضره‏"',
      description: 'أذكار الأحلام'
    },
  ],
  wake: [
    {
      id: 1,
      text: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
      description: ''
    },
    {
      id: 2,
      text: 'الحمد لله الذي عافاني في جسدي ورد علي روحي وأذن لي بذكره.',
      description: ''
    },
    {
      id: 3,
      text: 'لا إله إلا الله وحـده لا شـريك له، له الملـك وله الحمـد، وهو على كل شيء قدير، سـبحان الله، والحمـد لله ، ولا إله إلا الله والله أكبر، ولا حول ولا قوة إلا بالله العلي العظيم. رب اغفر لي.',
      description: ''
    },
  ],
  doa: [
    {
      id: 1,
      text: 'ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار',
      description: '[البقرة - 201].'
    },
    {
      id: 2,
      text: 'ربنا أفرغ علينا صبرا وثبت أقدامنا وانصرنا على القوم الكافرين',
      description: '[البقرة - 250].'
    },
    {
      id: 3,
      text: 'ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين',
      description: '[البقرة - 286].'
    },
    {
      id: 4,
      text: 'ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب',
      description: '[آل عمران - 8].'
    },
    {
      id: 5,
      text: 'ربنا إننا آمنا فاغفر لنا ذنوبنا وقنا عذاب النار',
      description: '[آل عمران - 16].'
    },
    {
      id: 6,
      text: 'رب هب لي من لدنك ذرية طيبة إنك سميع الدعاء',
      description: '[آل عمران - 38].'
    },
    {
      id: 7,
      text: 'ربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين',
      description: '[آل عمران - 53].'
    },
    {
      id: 8,
      text: 'ربنا اغفر لنا ذنوبنا وإسرافنا في أمرنا وثبت أقدامنا وانصرنا على القوم الكافرين',
      description: '[آل عمران - 147].'
    },
    {
      id: 9,
      text: 'ربنا ما خلقت هذا باطلا سبحانك فقنا عذاب النار ربنا إنك من تدخل النار فقد أخزيته وما للظالمين من أنصار ربنا إننا سمعنا مناديا ينادي للإيمان أن آمنوا بربكم فآمنا ربنا فاغفر لنا ذنوبنا وكفر عنا سيئاتنا وتوفنا مع الأبرار ربنا وآتنا ما وعدتنا على رسلك ولا تخزنا يوم القيامة إنك لا تخلف الميعاد',
      description: '[آل عمران - 191-194].'
    },
    {
      id: 10,
      text: 'ربنا ظلمنا أنفسنا وإن لم تغفر لنا وترحمنا لنكونن من الخاسرين',
      description: '[الأعراف - 23].'
    },
    {
      id: 11,
      text: 'ربنا لا تجعلنا مع القوم الظالمين',
      description: '[الأعراف - 47].'
    },
    {
      id: 12,
      text: 'ربنا أفرغ علينا صبرا وتوفنا مسلمين',
      description: '[الأعراف - 126].'
    },
    {
      id: 13,
      text: 'حسبي الله لا إلـه إلا هو عليه توكلت وهو رب العرش العظيم',
      description: '[التوبة - 129].'
    },
    {
      id: 14,
      text: 'ربنا لا تجعلنا فتنة للقوم الظالمين ونجنا برحمتك من القوم الكافرين',
      description: '[يونس - 85-86].'
    },
    {
      id: 15,
      text: 'رب إني أعوذ بك أن أسألك ما ليس لي به علم وإلا تغفر لي وترحمني أكن من الخاسرين',
      description: '[هود - 47].'
    },
    {
      id: 16,
      text: 'رب اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل دعاء',
      description: '[إبراهيم - 40].'
    },
    {
      id: 17,
      text: 'ربنا اغفر لي ولوالدي وللمؤمنين يوم يقوم الحساب',
      description: '[إبراهيم - 41].'
    },
    {
      id: 18,
      text: 'رب أدخلني مدخل صدق وأخرجني مخرج صدق واجعل لي من لدنك سلطانا نصيرا',
      description: '[الإسراء - 80].'
    },
    {
      id: 19,
      text: 'ربنا آتنا من لدنك رحمة وهيئ لنا من أمرنا رشدا',
      description: '[الكهف - 10].'
    },
    {
      id: 20,
      text: 'رب اشرح لي صدري ويسر لي أمري واحلل عقدة من لساني يفقهوا قولي',
      description: '[طه - 25-28].'
    },
    {
      id: 21,
      text: 'وَقُلْ رَبِّ زِدْنِي عِلْمًا',
      description: '[طه - 114].'
    },
    {
      id: 22,
      text: 'لا إله إلا أنت سبحانك إني كنت من الظالمين',
      description: '[الأنبياء - 87]'
    },
    {
      id: 23,
      text: 'رب لا تذرني فردا وأنت خير الوارثين',
      description: '[الأنبياء - 89]'
    },
    {
      id: 24,
      text: 'رب أعوذ بك من همزات الشياطين وأعوذ بك رب أن يحضرون',
      description: '[المؤمنون - 97-98].'
    },
    {
      id: 25,
      text: 'ربنا آمنا فاغفر لنا وارحمنا وأنت خير الراحمين',
      description: '[المؤمنون - 109]'
    },
    {
      id: 26,
      text: 'رب اغفر وارحم وأنت خير الراحمين',
      description: '[المؤمنون - 118].'
    },
  ]
};
